; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-4-23)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city4)
	(fuel-level plane1 fl3)
	(at plane2 city13)
	(fuel-level plane2 fl1)
	(at plane3 city14)
	(fuel-level plane3 fl0)
	(at plane4 city0)
	(fuel-level plane4 fl0)
	(at person1 city14)
	(at person2 city15)
	(at person3 city13)
	(at person4 city11)
	(at person5 city5)
	(at person6 city9)
	(at person7 city0)
	(at person8 city5)
	(at person9 city6)
	(at person10 city7)
	(at person11 city5)
	(at person12 city5)
	(at person13 city0)
	(at person14 city5)
	(at person15 city14)
	(at person16 city13)
	(at person17 city6)
	(at person18 city1)
	(at person19 city16)
	(at person20 city15)
	(at person21 city11)
	(at person22 city11)
	(at person23 city14)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city0)
	(at plane4 city5)
	(at person1 city4)
	(at person2 city1)
	(at person3 city16)
	(at person4 city4)
	(at person5 city0)
	(at person6 city0)
	(at person7 city2)
	(at person8 city12)
	(at person9 city1)
	(at person10 city3)
	(at person12 city15)
	(at person13 city12)
	(at person14 city7)
	(at person15 city12)
	(at person16 city4)
	(at person17 city4)
	(at person18 city10)
	(at person19 city0)
	(at person20 city8)
	(at person21 city13)
	(at person22 city2)
	(at person23 city2)
	))

)

; plan
1. (refuel plane4 city0 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 0 of 24
2. (board person7 plane4 city0)
   deleted: (at person7 city0)
   added: (in person7 plane4)
   goals met: 0 of 24
3. (board person13 plane4 city0)
   deleted: (at person13 city0)
   added: (in person13 plane4)
   goals met: 0 of 24
4. (board person23 plane3 city14)
   deleted: (at person23 city14)
   added: (in person23 plane3)
   goals met: 0 of 24
5. (refuel plane3 city14 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 0 of 24
6. (board person15 plane3 city14)
   deleted: (at person15 city14)
   added: (in person15 plane3)
   goals met: 0 of 24
7. (board person1 plane3 city14)
   deleted: (at person1 city14)
   added: (in person1 plane3)
   goals met: 0 of 24
8. (board person3 plane2 city13)
   deleted: (at person3 city13)
   added: (in person3 plane2)
   goals met: 0 of 24
9. (board person16 plane2 city13)
   deleted: (at person16 city13)
   added: (in person16 plane2)
   goals met: 0 of 24
10. (zoom plane1 city4 city0 fl3 fl2 fl1)
   deleted: (at plane1 city4) (fuel-level plane1 fl3)
   added: (at plane1 city0) (fuel-level plane1 fl1)
   goals met: 1 of 24
11. (fly plane2 city13 city16 fl1 fl0)
   deleted: (at plane2 city13) (fuel-level plane2 fl1)
   added: (at plane2 city16) (fuel-level plane2 fl0)
   goals met: 1 of 24
12. (refuel plane2 city16 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 1 of 24
13. (debark person3 plane2 city16)
   deleted: (in person3 plane2)
   added: (at person3 city16)
   goals met: 2 of 24
14. (board person19 plane2 city16)
   deleted: (at person19 city16)
   added: (in person19 plane2)
   goals met: 2 of 24
15. (fly plane2 city16 city0 fl1 fl0)
   deleted: (at plane2 city16) (fuel-level plane2 fl1)
   added: (at plane2 city0) (fuel-level plane2 fl0)
   goals met: 2 of 24
16. (refuel plane2 city0 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 2 of 24
17. (debark person19 plane2 city0)
   deleted: (in person19 plane2)
   added: (at person19 city0)
   goals met: 3 of 24
18. (fly plane2 city0 city4 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl1)
   added: (at plane2 city4) (fuel-level plane2 fl0)
   goals met: 3 of 24
19. (debark person16 plane2 city4)
   deleted: (in person16 plane2)
   added: (at person16 city4)
   goals met: 4 of 24
20. (fly plane4 city0 city12 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl1)
   added: (at plane4 city12) (fuel-level plane4 fl0)
   goals met: 4 of 24
21. (refuel plane4 city12 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 4 of 24
22. (debark person13 plane4 city12)
   deleted: (in person13 plane4)
   added: (at person13 city12)
   goals met: 5 of 24
23. (fly plane4 city12 city2 fl1 fl0)
   deleted: (at plane4 city12) (fuel-level plane4 fl1)
   added: (at plane4 city2) (fuel-level plane4 fl0)
   goals met: 5 of 24
24. (refuel plane4 city2 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 5 of 24
25. (debark person7 plane4 city2)
   deleted: (in person7 plane4)
   added: (at person7 city2)
   goals met: 6 of 24
26. (fly plane4 city2 city5 fl1 fl0)
   deleted: (at plane4 city2) (fuel-level plane4 fl1)
   added: (at plane4 city5) (fuel-level plane4 fl0)
   goals met: 7 of 24
27. (board person8 plane4 city5)
   deleted: (at person8 city5)
   added: (in person8 plane4)
   goals met: 7 of 24
28. (refuel plane4 city5 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 7 of 24
29. (board person5 plane4 city5)
   deleted: (at person5 city5)
   added: (in person5 plane4)
   goals met: 7 of 24
30. (board person14 plane4 city5)
   deleted: (at person14 city5)
   added: (in person14 plane4)
   goals met: 7 of 24
31. (board person12 plane4 city5)
   deleted: (at person12 city5)
   added: (in person12 plane4)
   goals met: 7 of 24
32. (fly plane3 city14 city12 fl1 fl0)
   deleted: (at plane3 city14) (fuel-level plane3 fl1)
   added: (at plane3 city12) (fuel-level plane3 fl0)
   goals met: 7 of 24
33. (refuel plane3 city12 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 7 of 24
34. (debark person15 plane3 city12)
   deleted: (in person15 plane3)
   added: (at person15 city12)
   goals met: 8 of 24
35. (fly plane3 city12 city2 fl1 fl0)
   deleted: (at plane3 city12) (fuel-level plane3 fl1)
   added: (at plane3 city2) (fuel-level plane3 fl0)
   goals met: 8 of 24
36. (refuel plane3 city2 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 8 of 24
37. (debark person23 plane3 city2)
   deleted: (in person23 plane3)
   added: (at person23 city2)
   goals met: 9 of 24
38. (fly plane3 city2 city4 fl1 fl0)
   deleted: (at plane3 city2) (fuel-level plane3 fl1)
   added: (at plane3 city4) (fuel-level plane3 fl0)
   goals met: 9 of 24
39. (debark person1 plane3 city4)
   deleted: (in person1 plane3)
   added: (at person1 city4)
   goals met: 10 of 24
40. (fly plane1 city0 city1 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 9 of 24
41. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 9 of 24
42. (board person18 plane1 city1)
   deleted: (at person18 city1)
   added: (in person18 plane1)
   goals met: 9 of 24
43. (fly plane1 city1 city10 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city10) (fuel-level plane1 fl0)
   goals met: 9 of 24
44. (refuel plane1 city10 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 9 of 24
45. (debark person18 plane1 city10)
   deleted: (in person18 plane1)
   added: (at person18 city10)
   goals met: 10 of 24
46. (fly plane1 city10 city11 fl1 fl0)
   deleted: (at plane1 city10) (fuel-level plane1 fl1)
   added: (at plane1 city11) (fuel-level plane1 fl0)
   goals met: 10 of 24
47. (refuel plane1 city11 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 10 of 24
48. (board person4 plane1 city11)
   deleted: (at person4 city11)
   added: (in person4 plane1)
   goals met: 10 of 24
49. (board person22 plane1 city11)
   deleted: (at person22 city11)
   added: (in person22 plane1)
   goals met: 10 of 24
50. (board person21 plane1 city11)
   deleted: (at person21 city11)
   added: (in person21 plane1)
   goals met: 10 of 24
51. (fly plane1 city11 city13 fl1 fl0)
   deleted: (at plane1 city11) (fuel-level plane1 fl1)
   added: (at plane1 city13) (fuel-level plane1 fl0)
   goals met: 10 of 24
52. (refuel plane1 city13 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 10 of 24
53. (debark person21 plane1 city13)
   deleted: (in person21 plane1)
   added: (at person21 city13)
   goals met: 11 of 24
54. (fly plane1 city13 city2 fl1 fl0)
   deleted: (at plane1 city13) (fuel-level plane1 fl1)
   added: (at plane1 city2) (fuel-level plane1 fl0)
   goals met: 11 of 24
55. (refuel plane1 city2 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 11 of 24
56. (debark person22 plane1 city2)
   deleted: (in person22 plane1)
   added: (at person22 city2)
   goals met: 12 of 24
57. (fly plane1 city2 city4 fl1 fl0)
   deleted: (at plane1 city2) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 12 of 24
58. (refuel plane1 city4 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 12 of 24
59. (debark person4 plane1 city4)
   deleted: (in person4 plane1)
   added: (at person4 city4)
   goals met: 13 of 24
60. (fly plane1 city4 city15 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl1)
   added: (at plane1 city15) (fuel-level plane1 fl0)
   goals met: 13 of 24
61. (refuel plane1 city15 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 13 of 24
62. (board person20 plane1 city15)
   deleted: (at person20 city15)
   added: (in person20 plane1)
   goals met: 13 of 24
63. (board person2 plane1 city15)
   deleted: (at person2 city15)
   added: (in person2 plane1)
   goals met: 13 of 24
64. (fly plane1 city15 city1 fl1 fl0)
   deleted: (at plane1 city15) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 13 of 24
65. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 13 of 24
66. (debark person2 plane1 city1)
   deleted: (in person2 plane1)
   added: (at person2 city1)
   goals met: 14 of 24
67. (fly plane1 city1 city8 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city8) (fuel-level plane1 fl0)
   goals met: 14 of 24
68. (refuel plane1 city8 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 14 of 24
69. (debark person20 plane1 city8)
   deleted: (in person20 plane1)
   added: (at person20 city8)
   goals met: 15 of 24
70. (fly plane1 city8 city6 fl1 fl0)
   deleted: (at plane1 city8) (fuel-level plane1 fl1)
   added: (at plane1 city6) (fuel-level plane1 fl0)
   goals met: 15 of 24
71. (refuel plane1 city6 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 15 of 24
72. (board person9 plane1 city6)
   deleted: (at person9 city6)
   added: (in person9 plane1)
   goals met: 15 of 24
73. (board person17 plane1 city6)
   deleted: (at person17 city6)
   added: (in person17 plane1)
   goals met: 15 of 24
74. (fly plane1 city6 city1 fl1 fl0)
   deleted: (at plane1 city6) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 15 of 24
75. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 15 of 24
76. (debark person9 plane1 city1)
   deleted: (in person9 plane1)
   added: (at person9 city1)
   goals met: 16 of 24
77. (fly plane1 city1 city4 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 16 of 24
78. (refuel plane1 city4 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 16 of 24
79. (debark person17 plane1 city4)
   deleted: (in person17 plane1)
   added: (at person17 city4)
   goals met: 17 of 24
80. (fly plane1 city4 city7 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl1)
   added: (at plane1 city7) (fuel-level plane1 fl0)
   goals met: 17 of 24
81. (refuel plane1 city7 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 17 of 24
82. (board person10 plane1 city7)
   deleted: (at person10 city7)
   added: (in person10 plane1)
   goals met: 17 of 24
83. (fly plane1 city7 city3 fl1 fl0)
   deleted: (at plane1 city7) (fuel-level plane1 fl1)
   added: (at plane1 city3) (fuel-level plane1 fl0)
   goals met: 17 of 24
84. (refuel plane1 city3 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 17 of 24
85. (debark person10 plane1 city3)
   deleted: (in person10 plane1)
   added: (at person10 city3)
   goals met: 18 of 24
86. (fly plane1 city3 city9 fl1 fl0)
   deleted: (at plane1 city3) (fuel-level plane1 fl1)
   added: (at plane1 city9) (fuel-level plane1 fl0)
   goals met: 18 of 24
87. (refuel plane1 city9 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 18 of 24
88. (board person6 plane1 city9)
   deleted: (at person6 city9)
   added: (in person6 plane1)
   goals met: 18 of 24
89. (fly plane1 city9 city0 fl1 fl0)
   deleted: (at plane1 city9) (fuel-level plane1 fl1)
   added: (at plane1 city0) (fuel-level plane1 fl0)
   goals met: 19 of 24
90. (debark person6 plane1 city0)
   deleted: (in person6 plane1)
   added: (at person6 city0)
   goals met: 20 of 24
91. (fly plane4 city5 city0 fl1 fl0)
   deleted: (at plane4 city5) (fuel-level plane4 fl1)
   added: (at plane4 city0) (fuel-level plane4 fl0)
   goals met: 19 of 24
92. (refuel plane4 city0 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 19 of 24
93. (debark person5 plane4 city0)
   deleted: (in person5 plane4)
   added: (at person5 city0)
   goals met: 20 of 24
94. (fly plane4 city0 city12 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl1)
   added: (at plane4 city12) (fuel-level plane4 fl0)
   goals met: 20 of 24
95. (refuel plane4 city12 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 20 of 24
96. (debark person8 plane4 city12)
   deleted: (in person8 plane4)
   added: (at person8 city12)
   goals met: 21 of 24
97. (fly plane4 city12 city15 fl1 fl0)
   deleted: (at plane4 city12) (fuel-level plane4 fl1)
   added: (at plane4 city15) (fuel-level plane4 fl0)
   goals met: 21 of 24
98. (refuel plane4 city15 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 21 of 24
99. (debark person12 plane4 city15)
   deleted: (in person12 plane4)
   added: (at person12 city15)
   goals met: 22 of 24
100. (fly plane4 city15 city7 fl1 fl0)
   deleted: (at plane4 city15) (fuel-level plane4 fl1)
   added: (at plane4 city7) (fuel-level plane4 fl0)
   goals met: 22 of 24
101. (refuel plane4 city7 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 22 of 24
102. (debark person14 plane4 city7)
   deleted: (in person14 plane4)
   added: (at person14 city7)
   goals met: 23 of 24
103. (fly plane4 city7 city5 fl1 fl0)
   deleted: (at plane4 city7) (fuel-level plane4 fl1)
   added: (at plane4 city5) (fuel-level plane4 fl0)
   goals met: 24 of 24
